README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-05 Tue 17:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Doom Config</title>
<meta name="author" content="Love Grover" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Doom Config</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgaefbaca">1. Description</a>
<ul>
<li><a href="#org3b737fe">1.1. Maintainers</a></li>
</ul>
</li>
<li><a href="#org48af556">2. config.el</a>
<ul>
<li><a href="#org906e79a">2.1. setting up user-name</a></li>
<li><a href="#org11fcda1">2.2. fonts</a></li>
<li><a href="#org7a215cf">2.3. theme</a></li>
<li><a href="#org7771dfd">2.4. add more packages</a>
<ul>
<li><a href="#orgf3716a6">2.4.1. org mode setting</a></li>
<li><a href="#org5ed7744">2.4.2. magit settings</a></li>
<li><a href="#org71eab2a">2.4.3. email setup</a></li>
<li><a href="#orgccf01cc">2.4.4. inline images</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org785e283">3. packages.el</a></li>
<li><a href="#orga42692c">4. init.el</a>
<ul>
<li><a href="#org7f4e940">4.1. input and completion</a></li>
<li><a href="#org25a3161">4.2. ui</a></li>
<li><a href="#orgd00cce9">4.3. editor</a></li>
<li><a href="#org12046c3">4.4. emacs and term</a></li>
<li><a href="#org8b51bd0">4.5. checkers</a></li>
<li><a href="#orgb8a2c16">4.6. tools</a></li>
<li><a href="#orgd63bd0f">4.7. os and lang</a></li>
<li><a href="#org8134ac4">4.8. email, app and config</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgaefbaca" class="outline-2">
<h2 id="orgaefbaca"><span class="section-number-2">1.</span> Description</h2>
<div class="outline-text-2" id="text-1">
<p>
This contains all doom config files which can create 3 files.<br />
</p>
</div>

<div id="outline-container-org3b737fe" class="outline-3">
<h3 id="org3b737fe"><span class="section-number-3">1.1.</span> Maintainers</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>@tolovegrover (Author)<br /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org48af556" class="outline-2">
<h2 id="org48af556"><span class="section-number-2">2.</span> config.el</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Remember, you do not need to run &rsquo;doom sync&rsquo; after modifying this file!<br /></li>

<li>Some functionality uses this to identify you, e.g. GPG configuration, email clients, file templates and snippets. It is optional.<br /></li>
</ul>
</div>

<div id="outline-container-org906e79a" class="outline-3">
<h3 id="org906e79a"><span class="section-number-3">2.1.</span> setting up user-name</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">user-full-name</span> <span style="color: #98be65;">"Love Grover"</span>
      <span style="color: #dcaeea;">user-mail-address</span> <span style="color: #98be65;">"tolovegrover@gmail.com"</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org11fcda1" class="outline-3">
<h3 id="org11fcda1"><span class="section-number-3">2.2.</span> fonts</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Doom exposes five (optional) variables for controlling fonts in Doom:<br />
</p>

<ul class="org-ul">
<li>`doom-font&rsquo; &#x2013; the primary font to use<br /></li>
<li>`doom-variable-pitch-font&rsquo; &#x2013; a non-monospace font (where applicable)<br /></li>
<li>`doom-big-font&rsquo; &#x2013; used for `doom-big-font-mode&rsquo;; use this for<br />
presentations or streaming.<br /></li>
<li>`doom-unicode-font&rsquo; &#x2013; for unicode glyphs<br /></li>
<li>`doom-serif-font&rsquo; &#x2013; for the `fixed-pitch-serif&rsquo; face<br /></li>
</ul>

<p>
See &rsquo;C-h v doom-font&rsquo; for documentation and more examples of what they<br />
accept.<br />
</p>

<p>
If you or Emacs can&rsquo;t find your font, use &rsquo;M-x describe-font&rsquo; to look them up, `M-x eval-region&rsquo; to execute elisp code, and &rsquo;M-x doom/reload-font&rsquo; to refresh your font settings. If Emacs still can&rsquo;t find your font, it likely wasn&rsquo;t installed correctly. Font issues are rarely Doom issues!<br />
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">doom-font</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">font-spec</span> <span style="color: #c678dd;">:family</span> <span style="color: #98be65;">"Love"</span> <span style="color: #c678dd;">:size</span> <span style="color: #da8548; font-weight: bold;">20</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">doom-variable-pitch-font</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">font-spec</span> <span style="color: #c678dd;">:family</span> <span style="color: #98be65;">"Love"</span> <span style="color: #c678dd;">:size</span> <span style="color: #da8548; font-weight: bold;">20</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7a215cf" class="outline-3">
<h3 id="org7a215cf"><span class="section-number-3">2.3.</span> theme</h3>
<div class="outline-text-3" id="text-2-3">
<p>
There are two ways to load a theme. Both assume the theme is installed and available. You can either set `doom-theme&rsquo; or manually load a theme with the `load-theme&rsquo; function. This is the default:<br />
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">doom-theme</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">doom-one</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">display-line-numbers-type</span> t<span style="color: #51afef;">)</span>
</pre>
</div>
<p>
;; If you use `org&rsquo; and don&rsquo;t want your org files in the default location below,<br />
;; change `org-directory&rsquo;. It must be set before org loads!<br />
</p>
</div>
</div>

<div id="outline-container-org7771dfd" class="outline-3">
<h3 id="org7771dfd"><span class="section-number-3">2.4.</span> add more packages</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Whenever you reconfigure a package, make sure to wrap your config in an<br />
`after!&rsquo; block, otherwise Doom&rsquo;s defaults may override your settings. E.g.<br />
</p>

<p>
(after! PACKAGE<br />
(setq x y))<br />
</p>

<p>
The exceptions to this rule:<br />
</p>

<ul class="org-ul">
<li>Setting file/directory variables (like `org-directory&rsquo;)<br /></li>
<li>Setting variables which explicitly tell you to set them before their<br />
package is loaded (see &rsquo;C-h v VARIABLE&rsquo; to look up their documentation).<br /></li>
<li>Setting doom variables (which start with &rsquo;doom-&rsquo; or &rsquo;+&rsquo;).<br /></li>
</ul>

<p>
Here are some additional functions/macros that will help you configure Doom.<br />
</p>

<ul class="org-ul">
<li>`load!&rsquo; for loading external *.el files relative to this one<br /></li>
<li>`use-package!&rsquo; for configuring packages<br /></li>
<li>`after!&rsquo; for running code after a package has loaded<br /></li>
<li>`add-load-path!&rsquo; for adding directories to the `load-path&rsquo;, relative to<br />
this file. Emacs searches the `load-path&rsquo; when you load packages with<br />
`require&rsquo; or `use-package&rsquo;.<br /></li>
<li>`map!&rsquo; for binding new keys<br /></li>
</ul>

<p>
To get information about any of these functions/macros, move the cursor over<br />
the highlighted symbol at press &rsquo;K&rsquo; (non-evil users must press &rsquo;C-c c k&rsquo;).<br />
This will open documentation for it, including demos of how they are used.<br />
Alternatively, use `C-h o&rsquo; to look up a symbol (functions, variables, faces,<br />
etc).<br />
</p>

<p>
You can also try &rsquo;gd&rsquo; (or &rsquo;C-c c d&rsquo;) to jump to their definition and see how<br />
they are implemented.<br />
</p>
</div>

<div id="outline-container-orgf3716a6" class="outline-4">
<h4 id="orgf3716a6"><span class="section-number-4">2.4.1.</span> org mode setting</h4>
<div class="outline-text-4" id="text-2-4-1">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-directory</span> <span style="color: #98be65;">"~/Documents/org/org/"</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> websocket
  <span style="color: #c678dd;">:after</span> org-roam<span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> org-roam-ui
  <span style="color: #c678dd;">:after</span> org-roam
  <span style="color: #c678dd;">:hook</span> <span style="color: #c678dd;">(</span>after-init . <span style="color: #dcaeea;">org-roam-ui-mode</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">:config</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start t<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> org-roam-graph-executable <span style="color: #98be65;">"dot"</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5ed7744" class="outline-4">
<h4 id="org5ed7744"><span class="section-number-4">2.4.2.</span> magit settings</h4>
<div class="outline-text-4" id="text-2-4-2">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> magit<span style="color: #51afef;">)</span>
<span style="color: #5B6268;">;;</span><span style="color: #5B6268;">(use-package! emacs-everywhere)</span>
</pre>
</div>
</div>
</div>
