README.org
*** email setup
#+begin_src elisp
(set-email-account!                                                                   "gmail"
 '((user-full-name         . "Love Grover")
   (mu4e-sent-folder       . "/[Gmail]/Sent Mail")
   (mu4e-trash-folder      . "/[Gmail]/Bin")
   (smtpmail-smtp-user     . "ph17047@iisermohali.ac.in")
   (user-mail-address      . "ph17047@iisermohali.ac.in")
   ;;(smtpmail-smtp-user     . "")
   (smtpmail-local-domain  . "gmail.com")
   (smtpmail-default-smtp-server . "smtp.gmail.com")
   (smtpmail-smtp-server . "smtp.gmail.com")
   (smtpmail-smtp-service . 587))
 t)

(setq org-msg-options "html-postamble:nil H:5 num:nil ^:{} toc:nil author:nil email:nil \\n:t"
      org-msg-startup "hidestars indent inlineimages"
      +org-msg-accent-color "#A020F0"
      org-msg-greeting-fmt "\nश्रीमन्%s,\n\n"
      org-msg-signature "\n\n#+begin_signature\nशुभम् भवतु, \\\\\nलव ग्रोवर, \\\\\nपीएचडी-भौतिकशास्त्रम् \\\\\nभारतीय विज्ञान शिक्षा और अनुसन्धान संस्थान- मोहाली, पञ्जाब, भारत\n#+end_signature")
#+end_src

*** inline images
#+begin_src elisp
(setq org-startup-with-inline-images t)
#+end_src
* packages.el
:PROPERTIES:
:header-args: :tangle packages.el
:END:


change need: doom sync and reload

example
(package! some-package)

To install a package directly from a remote git repo, you must specify a `:recipe'. You'll find documentation on what `:recipe' accepts here: https://github.com/raxod502/straight.el#the-recipe-format
package! another-package
:recipe (:host github :repo "username/repo"))

If the package you are trying to install does not contain a PACKAGENAME.el
file, or is located in a subdirectory of the repo, you'll need to specify
`:files' in the `:recipe':
package! this-package
:recipe (:host github :repo "username/repo"
:files ("some-file.el" "src/lisp/*.el")))

If you'd like to disable a package included with Doom, you can do so here
with the `:disable' property:
package! builtin-package :disable t)

You can override the recipe of a built in package without having to specify
all the properties for `:recipe'. These will inherit the rest of its recipe
from Doom or MELPA/ELPA/Emacsmirror:
package! builtin-package :recipe (:nonrecursive t))
package! builtin-package-2 :recipe (:repo "myfork/package"))

Specify a `:branch' to install a package from a particular branch or tag.
This is required for some packages whose default branch isn't 'master' (which
our package manager can't deal with; see raxod502/straight.el#279)
package! builtin-package :recipe (:branch "develop"))

Use `:pin' to specify a particular commit to install.
package! builtin-package :pin "1a2b3c4d5e")


Doom's packages are pinned to a specific commit and updated from release to
release. The `unpin!' macro allows you to unpin single packages...
unpin! pinned-package)
...or multiple packages
unpin! pinned-package another-pinned-package)
...Or *all* packages (NOT RECOMMENDED; will likely break things)
(unpin! t)

#+begin_src elisp
(unpin! org-roam)
(package! org-roam-ui)
#+end_src

* init.el
:PROPERTIES:
:header-args: :tangle init.el
:END:
init.el -*- lexical-binding: t; -*-

This file controls what Doom modules are enabled and what order they load
in. Remember to run 'doom sync' after modifying it!

NOTE Press 'SPC h d h' (or 'C-h d h' for non-vim users) to access Doom's
documentation. There you'll find a link to Doom's Module Index where all
of our modules are listed, including what flags they support.

NOTE Move your cursor over a module's name (or its flags) and press 'K' (or
'C-c c k' for non-vim users) to view its documentation. This works on
flags as well (those symbols that start with a plus).

Alternatively, press 'gd' (or 'C-c c d') on a module to browse its
directory (for easy access to its source code).

** input and completion

- input
  chinese
  japanese
  layout            ; auie,ctsrnm is the superior home row
- completion
  helm              ; the *other* search engine for love and life
  ido               ; the other *other* search engine...
  ivy               ; a search engine for love and life

#+begin_src elisp
(doom! :input
       :completion
       company           ; the ultimate code completion backend
       vertico           ; the search engine of the future
#+end_src

