README.html

<div id="outline-container-org71eab2a" class="outline-4">
<h4 id="org71eab2a"><span class="section-number-4">2.4.3.</span> email setup</h4>
<div class="outline-text-4" id="text-2-4-3">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #c678dd;">set-email-account!</span>                                                                   <span style="color: #98be65;">"gmail"</span>
 <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span><span style="color: #dcaeea;">user-full-name</span>         . <span style="color: #98be65;">"Love Grover"</span><span style="color: #98be65;">)</span>
   <span style="color: #98be65;">(</span>mu4e-sent-folder       . <span style="color: #98be65;">"/[Gmail]/Sent Mail"</span><span style="color: #98be65;">)</span>
   <span style="color: #98be65;">(</span>mu4e-trash-folder      . <span style="color: #98be65;">"/[Gmail]/Bin"</span><span style="color: #98be65;">)</span>
   <span style="color: #98be65;">(</span>smtpmail-smtp-user     . <span style="color: #98be65;">"ph17047@iisermohali.ac.in"</span><span style="color: #98be65;">)</span>
   <span style="color: #98be65;">(</span><span style="color: #dcaeea;">user-mail-address</span>      . <span style="color: #98be65;">"ph17047@iisermohali.ac.in"</span><span style="color: #98be65;">)</span>
   <span style="color: #5B6268;">;;</span><span style="color: #5B6268;">(smtpmail-smtp-user     . "")</span>
   <span style="color: #98be65;">(</span>smtpmail-local-domain  . <span style="color: #98be65;">"gmail.com"</span><span style="color: #98be65;">)</span>
   <span style="color: #98be65;">(</span>smtpmail-default-smtp-server . <span style="color: #98be65;">"smtp.gmail.com"</span><span style="color: #98be65;">)</span>
   <span style="color: #98be65;">(</span>smtpmail-smtp-server . <span style="color: #98be65;">"smtp.gmail.com"</span><span style="color: #98be65;">)</span>
   <span style="color: #98be65;">(</span>smtpmail-smtp-service . <span style="color: #da8548; font-weight: bold;">587</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
 t<span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> org-msg-options <span style="color: #98be65;">"html-postamble:nil H:5 num:nil ^:{} toc:nil author:nil email:nil \\n:t"</span>
      org-msg-startup <span style="color: #98be65;">"hidestars indent inlineimages"</span>
      +org-msg-accent-color <span style="color: #98be65;">"#A020F0"</span>
      org-msg-greeting-fmt <span style="color: #98be65;">"\n&#2358;&#2381;&#2352;&#2368;&#2350;&#2344;&#2381;%s,\n\n"</span>
      org-msg-signature <span style="color: #98be65;">"\n\n#+begin_signature\n&#2358;&#2369;&#2349;&#2350;&#2381; &#2349;&#2357;&#2340;&#2369;, \\\\\n&#2354;&#2357; &#2327;&#2381;&#2352;&#2379;&#2357;&#2352;, \\\\\n&#2346;&#2368;&#2319;&#2330;&#2337;&#2368;-&#2349;&#2380;&#2340;&#2367;&#2325;&#2358;&#2366;&#2360;&#2381;&#2340;&#2381;&#2352;&#2350;&#2381; \\\\\n&#2349;&#2366;&#2352;&#2340;&#2368;&#2351; &#2357;&#2367;&#2332;&#2381;&#2334;&#2366;&#2344; &#2358;&#2367;&#2325;&#2381;&#2359;&#2366; &#2324;&#2352; &#2309;&#2344;&#2369;&#2360;&#2344;&#2381;&#2343;&#2366;&#2344; &#2360;&#2306;&#2360;&#2381;&#2341;&#2366;&#2344;- &#2350;&#2379;&#2361;&#2366;&#2354;&#2368;, &#2346;&#2334;&#2381;&#2332;&#2366;&#2348;, &#2349;&#2366;&#2352;&#2340;\n#+end_signature"</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgccf01cc" class="outline-4">
<h4 id="orgccf01cc"><span class="section-number-4">2.4.4.</span> inline images</h4>
<div class="outline-text-4" id="text-2-4-4">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-startup-with-inline-images</span> t<span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org785e283" class="outline-2">
<h2 id="org785e283"><span class="section-number-2">3.</span> packages.el</h2>
<div class="outline-text-2" id="text-3">
<p>
change need: doom sync and reload<br />
</p>

<p>
example<br />
(package! some-package)<br />
</p>

<p>
To install a package directly from a remote git repo, you must specify a `:recipe&rsquo;. You&rsquo;ll find documentation on what `:recipe&rsquo; accepts here: <a href="https://github.com/raxod502/straight.el#the-recipe-format">https://github.com/raxod502/straight.el#the-recipe-format</a><br />
package! another-package<br />
:recipe (:host github :repo &ldquo;username/repo&rdquo;))<br />
</p>

<p>
If the package you are trying to install does not contain a PACKAGENAME.el<br />
file, or is located in a subdirectory of the repo, you&rsquo;ll need to specify<br />
`:files&rsquo; in the `:recipe&rsquo;:<br />
package! this-package<br />
:recipe (:host github :repo &ldquo;username/repo&rdquo;<br />
:files (&ldquo;some-file.el&rdquo; &ldquo;src/lisp/*.el&rdquo;)))<br />
</p>

<p>
If you&rsquo;d like to disable a package included with Doom, you can do so here<br />
with the `:disable&rsquo; property:<br />
package! builtin-package :disable t)<br />
</p>

<p>
You can override the recipe of a built in package without having to specify<br />
all the properties for `:recipe&rsquo;. These will inherit the rest of its recipe<br />
from Doom or MELPA/ELPA/Emacsmirror:<br />
package! builtin-package :recipe (:nonrecursive t))<br />
package! builtin-package-2 :recipe (:repo &ldquo;myfork/package&rdquo;))<br />
</p>

<p>
Specify a `:branch&rsquo; to install a package from a particular branch or tag.<br />
This is required for some packages whose default branch isn&rsquo;t &rsquo;master&rsquo; (which<br />
our package manager can&rsquo;t deal with; see raxod502/straight.el#279)<br />
package! builtin-package :recipe (:branch &ldquo;develop&rdquo;))<br />
</p>

<p>
Use `:pin&rsquo; to specify a particular commit to install.<br />
package! builtin-package :pin &ldquo;1a2b3c4d5e&rdquo;)<br />
</p>


<p>
Doom&rsquo;s packages are pinned to a specific commit and updated from release to<br />
release. The `unpin!&rsquo; macro allows you to unpin single packages&#x2026;<br />
unpin! pinned-package)<br />
&#x2026;or multiple packages<br />
unpin! pinned-package another-pinned-package)<br />
&#x2026;Or <b>all</b> packages (NOT RECOMMENDED; will likely break things)<br />
(unpin! t)<br />
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">unpin!</span> org-roam<span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">package!</span> org-roam-ui<span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga42692c" class="outline-2">
<h2 id="orga42692c"><span class="section-number-2">4.</span> init.el</h2>
<div class="outline-text-2" id="text-4">
<p>
init.el -<b>- lexical-binding: t; -</b>-<br />
</p>

<p>
This file controls what Doom modules are enabled and what order they load<br />
in. Remember to run &rsquo;doom sync&rsquo; after modifying it!<br />
</p>

<p>
NOTE Press &rsquo;SPC h d h&rsquo; (or &rsquo;C-h d h&rsquo; for non-vim users) to access Doom&rsquo;s<br />
documentation. There you&rsquo;ll find a link to Doom&rsquo;s Module Index where all<br />
of our modules are listed, including what flags they support.<br />
</p>

<p>
NOTE Move your cursor over a module&rsquo;s name (or its flags) and press &rsquo;K&rsquo; (or<br />
&rsquo;C-c c k&rsquo; for non-vim users) to view its documentation. This works on<br />
flags as well (those symbols that start with a plus).<br />
</p>

<p>
Alternatively, press &rsquo;gd&rsquo; (or &rsquo;C-c c d&rsquo;) on a module to browse its<br />
directory (for easy access to its source code).<br />
</p>
</div>

<div id="outline-container-org7f4e940" class="outline-3">
<h3 id="org7f4e940"><span class="section-number-3">4.1.</span> input and completion</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>input<br />
chinese<br />
japanese<br />
layout            ; auie,ctsrnm is the superior home row<br /></li>
<li>completion<br />
helm              ; the <b>other</b> search engine for love and life<br />
ido               ; the other <b>other</b> search engine&#x2026;<br />
ivy               ; a search engine for love and life<br /></li>
</ul>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">doom!</span> <span style="color: #c678dd;">:input</span>
       <span style="color: #c678dd;">:completion</span>
       company           <span style="color: #5B6268;">; </span><span style="color: #5B6268;">the ultimate code completion backend</span>
       vertico           <span style="color: #5B6268;">; </span><span style="color: #5B6268;">the search engine of the future</span>
</pre>
</div>
</div>
</div>
