README.org
** ui

deft              ; notational velocity for Emacs
hydra
indent-guides     ; highlighted indent columns
ligatures         ; ligatures and symbols to make your code pretty again
minimap           ; show a map of the code on the side
nav-flash         ; blink cursor line after big motions
neotree           ; a project drawer, like NERDTree for vim
tabs              ; a tab bar for Emacs
treemacs          ; a project drawer, like neotree but cooler
unicode           ; extended unicode support for various languages

zen               ; distraction-free coding or writing

#+begin_src elisp
:ui
doom              ; what makes DOOM look the way it does
doom-dashboard    ; a nifty splash screen for Emacs
doom-quit         ; DOOM quit-message prompts when you quit Emacs
hl-todo           ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
modeline          ; snazzy, Atom-inspired modeline, plus API
ophints           ; highlight the region an operation acts on
(popup +defaults)   ; tame sudden yet inevitable temporary windows
vc-gutter         ; vcs diff in the fringe
vi-tilde-fringe   ; fringe tildes to mark beyond EOB
workspaces        ; tab emulation, persistence & separate workspaces
window-select     ; visually switch windows
#+end_src

** editor

(evil +everywhere); come to the dark side, we have cookies\\
(format +onsave)  ; automated prettiness\\
god               ; run Emacs commands without modifier keys\\
lispy             ; vim for lisp, for people who don't like vim\\
multiple-cursors  ; editing in many places at once\\
objed             ; text object editing for the innocent\\
parinfer          ; turn lisp into python, sort of\\
rotate-text       ; cycle region at point between text candidates\\
word-wrap         ; soft wrapping with language-aware indent\\


#+begin_src elisp
:editor

file-templates    ; auto-snippets for empty files
fold              ; (nigh) universal code folding
snippets          ; my elves. They type so I don't have to

#+end_src

** emacs and term
- emacs
  ibuffer         ; interactive buffer management
- term
  eshell            ; the elisp shell that works everywhere
  shell             ; simple shell REPL for Emacs
  term              ; basic terminal emulator for Emacs
  vterm             ; the best terminal emulation in Emacs


#+begin_src elisp
:emacs
dired             ; making dired pretty [functional]
electric          ; smarter, keyword-based electric-indent
undo              ; persistent, smarter undo for your inevitable mistakes
vc                ; version-control and Emacs, sitting in a tree
:term
#+end_src

** checkers

#+begin_src elisp
:checkers
syntax              ; tasing you for every semicolon you forget
(spell +flyspell) ; tasing you for misspelling mispelling
grammar           ; tasing grammar mistake every you make
#+end_src

** tools
ansible

debugger          ; FIXME stepping through code, to help you add bugs
direnv
docker3
gist              ; interacting with github gists
lsp               ; M-x vscode
make              ; run make tasks from Emacs
pass              ; password manager for nerds
prodigy           ; FIXME managing external services & code builders
taskrunner        ; taskrunner for all your projects
terraform         ; infrastructure as code
tmux              ; an API for interacting with tmux
upload            ; map local to remote projects via ssh/ftp

#+begin_src elisp
:tools
(eval +overlay)     ; run code, run (also, repls)
lookup              ; navigate your code and its documentation
magit             ; a git porcelain for Emacs
biblio            ; Writes a PhD for you (citation needed)
pdf               ; pdf enhancements
rgb               ; creating color strings
editorconfig      ; let someone else argue about tabs vs spaces
ein               ; tame Jupyter notebooks with emacs
#+end_src

