README.html

<div id="outline-container-org25a3161" class="outline-3">
<h3 id="org25a3161"><span class="section-number-3">4.2.</span> ui</h3>
<div class="outline-text-3" id="text-4-2">
<p>
deft              ; notational velocity for Emacs<br />
hydra<br />
indent-guides     ; highlighted indent columns<br />
ligatures         ; ligatures and symbols to make your code pretty again<br />
minimap           ; show a map of the code on the side<br />
nav-flash         ; blink cursor line after big motions<br />
neotree           ; a project drawer, like NERDTree for vim<br />
tabs              ; a tab bar for Emacs<br />
treemacs          ; a project drawer, like neotree but cooler<br />
unicode           ; extended unicode support for various languages<br />
</p>

<p>
zen               ; distraction-free coding or writing<br />
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #c678dd;">:ui</span>
doom              <span style="color: #5B6268;">; </span><span style="color: #5B6268;">what makes DOOM look the way it does</span>
doom-dashboard    <span style="color: #5B6268;">; </span><span style="color: #5B6268;">a nifty splash screen for Emacs</span>
doom-quit         <span style="color: #5B6268;">; </span><span style="color: #5B6268;">DOOM quit-message prompts when you quit Emacs</span>
hl-todo           <span style="color: #5B6268;">; </span><span style="color: #5B6268;">highlight </span><span style="color: #ECBE7B; font-weight: bold;">TODO</span><span style="color: #5B6268;">/</span><span style="color: #ff6c6b; font-weight: bold;">FIXME</span><span style="color: #5B6268;">/</span><span style="color: #98be65; font-weight: bold;">NOTE</span><span style="color: #5B6268;">/</span><span style="color: #83898d; font-weight: bold;">DEPRECATED</span><span style="color: #5B6268;">/</span><span style="color: #a9a1e1; font-weight: bold;">HACK</span><span style="color: #5B6268;">/</span><span style="color: #51afef; font-weight: bold;">REVIEW</span>
modeline          <span style="color: #5B6268;">; </span><span style="color: #5B6268;">snazzy, Atom-inspired modeline, plus API</span>
ophints           <span style="color: #5B6268;">; </span><span style="color: #5B6268;">highlight the region an operation acts on</span>
<span style="color: #51afef;">(</span>popup +defaults<span style="color: #51afef;">)</span>   <span style="color: #5B6268;">; </span><span style="color: #5B6268;">tame sudden yet inevitable temporary windows</span>
vc-gutter         <span style="color: #5B6268;">; </span><span style="color: #5B6268;">vcs diff in the fringe</span>
vi-tilde-fringe   <span style="color: #5B6268;">; </span><span style="color: #5B6268;">fringe tildes to mark beyond EOB</span>
workspaces        <span style="color: #5B6268;">; </span><span style="color: #5B6268;">tab emulation, persistence &amp; separate workspaces</span>
window-select     <span style="color: #5B6268;">; </span><span style="color: #5B6268;">visually switch windows</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd00cce9" class="outline-3">
<h3 id="orgd00cce9"><span class="section-number-3">4.3.</span> editor</h3>
<div class="outline-text-3" id="text-4-3">
<p>
(evil +everywhere); come to the dark side, we have cookies<br />
(format +onsave)  ; automated prettiness<br />
god               ; run Emacs commands without modifier keys<br />
lispy             ; vim for lisp, for people who don&rsquo;t like vim<br />
multiple-cursors  ; editing in many places at once<br />
objed             ; text object editing for the innocent<br />
parinfer          ; turn lisp into python, sort of<br />
rotate-text       ; cycle region at point between text candidates<br />
word-wrap         ; soft wrapping with language-aware indent<br />
</p>


<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #c678dd;">:editor</span>

file-templates    <span style="color: #5B6268;">; </span><span style="color: #5B6268;">auto-snippets for empty files</span>
fold              <span style="color: #5B6268;">; </span><span style="color: #5B6268;">(nigh) universal code folding</span>
snippets          <span style="color: #5B6268;">; </span><span style="color: #5B6268;">my elves. They type so I don't have to</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org12046c3" class="outline-3">
<h3 id="org12046c3"><span class="section-number-3">4.4.</span> emacs and term</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>emacs<br />
ibuffer         ; interactive buffer management<br /></li>
<li>term<br />
eshell            ; the elisp shell that works everywhere<br />
shell             ; simple shell REPL for Emacs<br />
term              ; basic terminal emulator for Emacs<br />
vterm             ; the best terminal emulation in Emacs<br /></li>
</ul>


<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #c678dd;">:emacs</span>
dired             <span style="color: #5B6268;">; </span><span style="color: #5B6268;">making dired pretty [functional]</span>
electric          <span style="color: #5B6268;">; </span><span style="color: #5B6268;">smarter, keyword-based electric-indent</span>
undo              <span style="color: #5B6268;">; </span><span style="color: #5B6268;">persistent, smarter undo for your inevitable mistakes</span>
vc                <span style="color: #5B6268;">; </span><span style="color: #5B6268;">version-control and Emacs, sitting in a tree</span>
<span style="color: #c678dd;">:term</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8b51bd0" class="outline-3">
<h3 id="org8b51bd0"><span class="section-number-3">4.5.</span> checkers</h3>
<div class="outline-text-3" id="text-4-5">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #c678dd;">:checkers</span>
syntax              <span style="color: #5B6268;">; </span><span style="color: #5B6268;">tasing you for every semicolon you forget</span>
<span style="color: #51afef;">(</span>spell +flyspell<span style="color: #51afef;">)</span> <span style="color: #5B6268;">; </span><span style="color: #5B6268;">tasing you for misspelling mispelling</span>
grammar           <span style="color: #5B6268;">; </span><span style="color: #5B6268;">tasing grammar mistake every you make</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb8a2c16" class="outline-3">
<h3 id="orgb8a2c16"><span class="section-number-3">4.6.</span> tools</h3>
<div class="outline-text-3" id="text-4-6">
<p>
ansible<br />
</p>

<p>
debugger          ; FIXME stepping through code, to help you add bugs<br />
direnv<br />
docker3<br />
gist              ; interacting with github gists<br />
lsp               ; M-x vscode<br />
make              ; run make tasks from Emacs<br />
pass              ; password manager for nerds<br />
prodigy           ; FIXME managing external services &amp; code builders<br />
taskrunner        ; taskrunner for all your projects<br />
terraform         ; infrastructure as code<br />
tmux              ; an API for interacting with tmux<br />
upload            ; map local to remote projects via ssh/ftp<br />
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #c678dd;">:tools</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">eval</span> +overlay<span style="color: #51afef;">)</span>     <span style="color: #5B6268;">; </span><span style="color: #5B6268;">run code, run (also, repls)</span>
lookup              <span style="color: #5B6268;">; </span><span style="color: #5B6268;">navigate your code and its documentation</span>
magit             <span style="color: #5B6268;">; </span><span style="color: #5B6268;">a git porcelain for Emacs</span>
biblio            <span style="color: #5B6268;">; </span><span style="color: #5B6268;">Writes a PhD for you (citation needed)</span>
pdf               <span style="color: #5B6268;">; </span><span style="color: #5B6268;">pdf enhancements</span>
rgb               <span style="color: #5B6268;">; </span><span style="color: #5B6268;">creating color strings</span>
editorconfig      <span style="color: #5B6268;">; </span><span style="color: #5B6268;">let someone else argue about tabs vs spaces</span>
ein               <span style="color: #5B6268;">; </span><span style="color: #5B6268;">tame Jupyter notebooks with emacs</span>
</pre>
</div>
</div>
</div>
