README.org
** os and lang

agda              ; types of types of types of types...\\
beancount         ; mind the GAAP\\
(cc +lsp)        ; C > C++ == 1\\
clojure           ; java with a lisp\\
common-lisp       ; if you've seen one lisp, you've seen them all\\
coq               ; proofs-as-programs\\
crystal           ; ruby at the speed of c\\
csharp            ; unity, .NET, and mono shenanigans\\
data              ; config/data formats\\
(dart +flutter)   ; paint ui and not much else\\
dhall\\
elixir            ; erlang done right\\
elm               ; care for a cup of TEA?\\
erlang            ; an elegant language for a more civilized age\\
ess               ; emacs speaks statistics\\
factor\\
faust             ; dsp, but you get to keep your soul\\
fsharp            ; ML stands for Microsoft's Language\\
fstar             ; (dependent) types and (monadic) effects and Z3\\
gdscript          ; the language you waited for\\
(go +lsp)         ; the hipster dialect\\
(haskell +lsp)    ; a language that's lazier than I am\\
hy                ; readability of scheme w/ speed of python\\
idris             ; a language you can depend on\\
json              ; At least it ain't XML\\
(java +lsp)       ; the poster child for carpal tunnel syndrome\\
javascript        ; all(hope(abandon(ye(who(enter(here))))))\\
julia             ; a better, faster MATLAB\\
kotlin            ; a better, slicker Java(Script)\\
latex             ; writing papers in Emacs has never been so fun\\
lean              ; for folks with too much to prove\\
ledger            ; be audit you can be\\
lua               ; one-based indices? one-based indices\\
nim               ; python + lisp at the speed of c\\
nix               ; I hereby declare "nix geht mehr!"\\
ocaml             ; an objective camel\\
php               ; perl's insecure younger brother\\
plantuml          ; diagrams for confusing people more\\
purescript        ; javascript, but functional\\
qt                ; the 'cutest' gui framework ever\\
racket            ; a DSL for DSLs\\
raku              ; the artist formerly known as perl6\\
rest              ; Emacs as a REST client\\
rst               ; ReST in peace\\
(ruby +rails)     ; 1.step {|i| p "Ruby is #{i.even? ? 'love' : 'life'}"}\\
rust              ; Fe2O3.unwrap().unwrap().unwrap().unwrap()\\
scala             ; java, but good\\
(scheme +guile)   ; a fully conniving family of lisps\\
sml\\
solidity          ; do you need a blockchain? No.\\
swift             ; who asked for emoji variables?\\
terra             ; Earth and Moon in alignment for performance.\\
web               ; the tubes\\
yaml              ; JSON, but readable\\
zig               ; C, but simpler\\

#+begin_src elisp
:os
(:if IS-MAC macos)  ; improve compatibility with macOS
tty               ; improve the terminal Emacs experience

:lang
emacs-lisp        ; drown in parentheses
fortran           ; in FORTRAN, GOD is REAL (unless declared INTEGER)
markdown          ; writing docs for people to ignore
org               ; organize your plain life in plain text
sh                ; she sells {ba,z,fi}sh shells on the C xor
python            ; beautiful is better than ugly
#+end_src

** email, app and config
- email

  notmuch
  (wanderlust +gmail)
- app
  calendar
  irc               ; how neckbeards socialize
  (rss +org)        ; emacs as an RSS reader
  twitter           ; twitter client https://twitter.com/vnought
- config
  literate

#+begin_src elisp
:email
(mu4e +org +gmail)

:app
calendar
emms
everywhere        ; *leave* Emacs!? You must be joking

:config
(default +bindings +smartparens))
#+end_src
