README.html

<div id="outline-container-orgd63bd0f" class="outline-3">
<h3 id="orgd63bd0f"><span class="section-number-3">4.7.</span> os and lang</h3>
<div class="outline-text-3" id="text-4-7">
<ul class="org-ul">
<li>lang<br />
agda              ; types of types of types of types&#x2026;<br />
beancount         ; mind the GAAP<br />
(cc <del>lsp)        ; C &gt; C+</del> == 1<br />
clojure           ; java with a lisp<br />
common-lisp       ; if you&rsquo;ve seen one lisp, you&rsquo;ve seen them all<br />
coq               ; proofs-as-programs<br />
crystal           ; ruby at the speed of c<br />
csharp            ; unity, .NET, and mono shenanigans<br />
data              ; config/data formats<br />
(dart +flutter)   ; paint ui and not much else<br />
dhall<br />
elixir            ; erlang done right<br />
elm               ; care for a cup of TEA?<br />
erlang            ; an elegant language for a more civilized age<br />
ess               ; emacs speaks statistics<br />
factor<br />
faust             ; dsp, but you get to keep your soul<br />
fsharp            ; ML stands for Microsoft&rsquo;s Language<br />
fstar             ; (dependent) types and (monadic) effects and Z3<br />
gdscript          ; the language you waited for<br />
(go +lsp)         ; the hipster dialect<br />
(haskell +lsp)    ; a language that&rsquo;s lazier than I am<br />
hy                ; readability of scheme w/ speed of python<br />
idris             ; a language you can depend on<br />
json              ; At least it ain&rsquo;t XML<br />
(java +lsp)       ; the poster child for carpal tunnel syndrome<br />
javascript        ; all(hope(abandon(ye(who(enter(here))))))<br />
julia             ; a better, faster MATLAB<br />
kotlin            ; a better, slicker Java(Script)<br />
latex             ; writing papers in Emacs has never been so fun<br />
lean              ; for folks with too much to prove<br />
ledger            ; be audit you can be<br />
lua               ; one-based indices? one-based indices<br />
nim               ; python + lisp at the speed of c<br />
nix               ; I hereby declare &ldquo;nix geht mehr!&rdquo;<br />
ocaml             ; an objective camel<br />
php               ; perl&rsquo;s insecure younger brother<br />
plantuml          ; diagrams for confusing people more<br />
purescript        ; javascript, but functional<br />
qt                ; the &rsquo;cutest&rsquo; gui framework ever<br />
racket            ; a DSL for DSLs<br />
raku              ; the artist formerly known as perl6<br />
rest              ; Emacs as a REST client<br />
rst               ; ReST in peace<br />
(ruby +rails)     ; 1.step {|i| p &ldquo;Ruby is #{i.even? ? &lsquo;love&rsquo; : &lsquo;life&rsquo;}&rdquo;}<br />
rust              ; Fe2O3.unwrap().unwrap().unwrap().unwrap()<br />
scala             ; java, but good<br />
(scheme +guile)   ; a fully conniving family of lisps<br />
sml<br />
solidity          ; do you need a blockchain? No.<br />
swift             ; who asked for emoji variables?<br />
terra             ; Earth and Moon in alignment for performance.<br />
web               ; the tubes<br />
yaml              ; JSON, but readable<br />
zig               ; C, but simpler<br /></li>
</ul>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #c678dd;">:os</span>
<span style="color: #51afef;">(</span><span style="color: #c678dd;">:if</span> <span style="color: #dcaeea;">IS-MAC</span> macos<span style="color: #51afef;">)</span>  <span style="color: #5B6268;">; </span><span style="color: #5B6268;">improve compatibility with macOS</span>
tty               <span style="color: #5B6268;">; </span><span style="color: #5B6268;">improve the terminal Emacs experience</span>

<span style="color: #c678dd;">:lang</span>
emacs-lisp        <span style="color: #5B6268;">; </span><span style="color: #5B6268;">drown in parentheses</span>
fortran           <span style="color: #5B6268;">; </span><span style="color: #5B6268;">in FORTRAN, GOD is REAL (unless declared INTEGER)</span>
markdown          <span style="color: #5B6268;">; </span><span style="color: #5B6268;">writing docs for people to ignore</span>
org               <span style="color: #5B6268;">; </span><span style="color: #5B6268;">organize your plain life in plain text</span>
sh                <span style="color: #5B6268;">; </span><span style="color: #5B6268;">she sells {ba,z,fi}sh shells on the C xor</span>
python            <span style="color: #5B6268;">; </span><span style="color: #5B6268;">beautiful is better than ugly</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8134ac4" class="outline-3">
<h3 id="org8134ac4"><span class="section-number-3">4.8.</span> email, app and config</h3>
<div class="outline-text-3" id="text-4-8">
<ul class="org-ul">
<li><p>
email<br />
</p>

<p>
notmuch<br />
(wanderlust +gmail)<br />
</p></li>
<li>app<br />
calendar<br />
irc               ; how neckbeards socialize<br />
(rss +org)        ; emacs as an RSS reader<br />
twitter           ; twitter client <a href="https://twitter.com/vnought">https://twitter.com/vnought</a><br /></li>
<li>config<br />
literate<br /></li>
</ul>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #c678dd;">:email</span>
<span style="color: #51afef;">(</span><span style="color: #c678dd;">mu4e</span> +org +gmail<span style="color: #51afef;">)</span>

<span style="color: #c678dd;">:app</span>
calendar
emms
everywhere        <span style="color: #5B6268;">; </span><span style="color: #5B6268;">*leave* Emacs!? You must be joking</span>

<span style="color: #c678dd;">:config</span>
<span style="color: #51afef;">(</span>default +bindings +smartparens<span style="color: #51afef;">)</span><span style="color: #ff6c6b; font-weight: bold;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: March 18, 2022</p>
<p class="author">Author: Love Grover</p>
<p class="date">Created: 2022-04-05 Tue 17:32</p>
</div>
</body>
</html>
