init.el
(:if IS-MAC macos)  ; improve compatibility with macOS
tty               ; improve the terminal Emacs experience

:lang
emacs-lisp        ; drown in parentheses
fortran           ; in FORTRAN, GOD is REAL (unless declared INTEGER)
markdown          ; writing docs for people to ignore
org               ; organize your plain life in plain text
sh                ; she sells {ba,z,fi}sh shells on the C xor

:email
(mu4e +org +gmail)

:app

:config
(default +bindings +smartparens))
